In [2]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

'Connected: jovyan@si330'

## More Advanced Operations!

* To get data out of the database and work with it we use the SELECT statement
* The select statement requires us at a minimum to indicate the columns we are interested in and the table we are interested in
* Base form is `SELECT cols FROM table`
* Note that the return value of the select statement is itself a relation (table)

In [3]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330
import psycopg2
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330')
%sql drop table if exists person
pd.read_csv('datasets/person.csv').to_sql('person', engine) #turn csv to sql database
%sql drop table if exists sales
pd.read_csv('datasets/sales.csv').to_sql('person', engine) #turn csv to sql database

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * postgres://jovyan:***@localhost:5432/si330
Done.
 * postgres://jovyan:***@localhost:5432/si330
Done.

ValueError: Table 'person' already exists.

In [4]:
%sql select first_name from person;
# we can limit this to a certain number of rows with the LIMIT clause
%sql select first_name from person limit 10

 * postgres://jovyan:***@localhost:5432/si330
1000 rows affected.
 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[('Amanda',),
 ('Monica',),
 ('Keith',),
 ('Mark',),
 ('Amber',),
 ('Allison',),
 ('Cindy',),
 ('Paul',),
 ('Cynthia',),
 ('Brian',)]

* Statements in SQL are terminated with a semicolon, but when we are executing them in python the library which handles the connection will generally terminate the statement for us at the end of the line
* Notice that the return relation isn't sorted. It's up to the database to determine what order the items you get are in
* Beyond this, the database can choose any ten items when you make a limit call; there is no intrinsic ordering of your results, though some database vendors may choose to do so based on recency

In [5]:
# when you select multiple columns from a single database the results are row consistent, 
# e.g. the first name and last names align
%sql select first_name, last_name from person limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Amanda', 'Miller'),
 ('Monica', 'Jenkins'),
 ('Keith', 'Richards'),
 ('Mark', 'Cowan'),
 ('Amber', 'King')]

In [6]:
# it's common to use an * as a wildcard for any column
%sql select * from person limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (2, 'Keith', 'Richards', '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (3, 'Mark', 'Cowan', '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046)]

In [31]:
# we can limit the results we want to return using a WHERE clouse
%sql select first_name from person where last_name = 'King' limit 5
#make sure strings are in single quotes

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Amber',), ('Arthur',), ('Jon',), ('Raymond',), ('Jill',)]

In [7]:
%sql select * from person where last_name = 'King' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046),
 (550, 'Arthur', 'King', '60731 Michael Orchard Suite 645', 'South Sherryfort', 28386, 3078),
 (624, 'Jon', 'King', '8859 Harris Fields', 'Nathanton', 44911, 3968),
 (743, 'Raymond', 'King', '465 Murphy Village Apt. 717', 'Andreaport', 1366, 3912),
 (899, 'Jill', 'King', '8360 Carter Prairie Apt. 810', 'Kevintown', 85243, 1259)]

In [32]:
# note the single quotes for strings in sql!
# there are two wildcard options with varchar matching in SQL:
# _ matches a single character
# % matches any number of characters
# to use these we must use the LIKE operator

# find all people who have a name which starts with Chris
%sql select first_name from person where first_name like 'Chris%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Christopher',),
 ('Christopher',),
 ('Christopher',),
 ('Christopher',),
 ('Christina',)]

In [33]:
%sql select first_name from person where first_name like 'Chris_' limit 5

 * postgres://jovyan:***@localhost:5432/si330
0 rows affected.

[]

* Unfortunatly, this form of string comparison is super limited. But it's pretty easy to optimize, so you should be aware of how to use it
* SQL has no regex functionality built into it :(
* (But the dirty truth is everyone loves regex so much you can use regex with a few custom functions)
* String matching is of course, case sensitive
* We can negate the like operator too with NOT

In [8]:
%sql select last_name from person where last_name not like 'K%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Miller',), ('Jenkins',), ('Richards',), ('Cowan',), ('Silva',)]

In [35]:
# for numeric columns we can also use our regular numeric operators
%sql select * from person where index < 2

 * postgres://jovyan:***@localhost:5432/si330
2 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910)]

In [36]:
# SQL uses an odd syntax for not equals, the <> operator
%sql select * from person where index != 2 limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(0, 'Amanda', 'Miller', '4302 John Skyway Apt. 650', 'West Victor', 55311, 4910),
 (1, 'Monica', 'Jenkins', '2794 Danielle Skyway Suite 323', 'West Jenniferport', 91875, 910),
 (3, 'Mark', 'Cowan', '4026 Timothy Court', 'New Sarah', 40411, 8764),
 (4, 'Amber', 'King', '74417 Warren Ways Apt. 647', 'South Kelly', 40440, 6046),
 (5, 'Allison', 'Silva', '68090 Taylor Harbor', 'South Robertton', 82971, 4895)]

In [37]:
# we can chain multiple where comparisons together using AND
%sql select * from person where index < 100 and index > 20 and first_name like '%ar%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(21, 'Howard', 'Brown', '60122 Miller Street Apt. 853', 'West Edwinside', 60598, 6985),
 (24, 'Sara', 'Jones', '59767 Ray Squares Suite 908', 'South Tim', 91692, 4600),
 (35, 'Edward', 'Collins', '62798 Amanda Forks', 'South Michelle', 46109, 5314),
 (52, 'Tara', 'Daniels', '583 Laura Road Apt. 049', 'South Jessica', 50028, 1407),
 (53, 'Zachary', 'Jones', '318 Murphy Course Apt. 184', 'South Tinaland', 37867, 3304)]

In [38]:
# how would you have written the above in pandas?

In [39]:
# another nice function in sql for ranges is BETWEEN and NOT BETWEEN (which are inclusive)
%sql select * from person where index between 10 and 13

 * postgres://jovyan:***@localhost:5432/si330
4 rows affected.

[(10, 'Heather', 'Huber', '56064 Colleen Mall Suite 443', 'New Elizabethside', 15595, 575),
 (11, 'Eric', 'Castaneda', '9497 Shannon Greens', 'Julieberg', 16296, 9229),
 (12, 'Corey', 'Smith', '499 Nathaniel Stravenue', 'East Davidtown', 61382, 3546),
 (13, 'Henry', 'Chavez', '74215 James Plaza', 'East Robinville', 10850, 9374)]

In [40]:
# another important operator is IN, which does set comparison
%sql select * from person where first_name in ('Christopher', 'Michael', 'George') limit 10

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(22, 'Christopher', 'Caldwell', '4163 Marshall Alley', 'Lake Davidview', 49487, 9127),
 (47, 'Christopher', 'May', '45898 Jackson Islands', 'Mathewborough', 60118, 914),
 (88, 'Christopher', 'Olson', '29907 Lisa Lakes Apt. 825', 'Mayomouth', 40316, 681),
 (100, 'Christopher', 'Duncan', '041 Morris Lakes', 'East Rebecca', 6496, 6312),
 (147, 'Michael', 'Larson', '090 Nichols Valley Suite 019', 'Rayport', 50329, 5369),
 (203, 'Michael', 'Lopez', '13010 Evans Valleys', 'Carolinetown', 99299, 5469),
 (267, 'Michael', 'Ayala', '33385 Gardner Mount Apt. 885', 'Monicamouth', 16720, 7713),
 (272, 'Michael', 'Rodriguez', '80850 Rebecca View Suite 451', 'Debraburgh', 42822, 9985),
 (280, 'Michael', 'Cruz', '0723 Drew Way', 'South Bradley', 21350, 8760),
 (349, 'Michael', 'Gardner', '6355 Kyle Spur', 'Dunnfurt', 76831, 8301)]

### Aggregation and Subselects
In SQL, we can use aggregation functions as well.

An aggregation converts a vector into a scalar, just like in Pandas. Lots of values in, one value out.

In [41]:
# We use these on the columns
%sql select count(first_name) from person
# How many first_name rows are there in the table person?

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000,)]

In [42]:
# It's more common to see people count all of the columns, functionally there is a difference but the pattern is so common
# databases return the result quickly. Of course, the length (count) of each column is the same
%sql select count(*) from person

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(1000,)]

In [43]:
# lots of other aggregation functions exist as you might expect

In [44]:
%sql select max(index), min(index), count(*) from person

 * postgres://jovyan:***@localhost:5432/si330
1 rows affected.

[(999, 0, 1000)]

In [45]:
# This is an interesting query, because the return table has one row, three columns, and is just a bunch of
# summary information. Remember, the return value of a select statement is always itself a table (relation)
# How might we try and get a list of all unique firstnames with a count of how many occur 
# in our dataset?

In [46]:
%sql select count(first_name), first_name from person

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.GroupingError) column "person.first_name" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: select count(first_name), first_name from person
                                  ^

[SQL: select count(first_name), first_name from person]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [47]:
# This doesn't do what we want. Just like in pandas we need to tell SQL how we want to 
# group the data. once we group the data then the return result is just a combination 
# of the aggregation functions (note alias)

In [48]:
%%sql 
select first_name as firstname_nounderscore, count(first_name) as awesome_column
from person 
group by first_name 
order by first_name
limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Aaron', 2), ('Abigail', 2), ('Adam', 6), ('Alejandro', 1), ('Alex', 1)]

In [49]:
# just like in pandas we can group by multiple columns. This means we need a unique 
# combination of the two columns
# remember that cell magics (%%) must start the cell, can't have comments up top!

In [50]:
%%sql
select first_name, last_name, count(*) as num
from person
where first_name like 'Chris%'
group by first_name, last_name
order by num desc
limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Christian', 'Peterson', 1),
 ('Christina', 'Sandoval', 1),
 ('Christine', 'Brady', 1),
 ('Christine', 'Hogan', 1),
 ('Christian', 'Johnson', 1)]

In [51]:
# ok, you've heard me say again and again that every select returns a table, and we 
# know that select statements work on tables, so why not have a select statement work on 
# a select statement result?

# These are called subselects, and it's a beautiful beautiful thing!

In [9]:
%sql select * from person where city like 'Port%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(2, 'Keith', 'Richards', '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (38, 'Traci', 'Carter', '75676 Simon Causeway', 'Port Mariah', 28378, 7342),
 (48, 'William', 'Robinson', '5531 Sarah Trace Suite 854', 'Port Lauraport', 1541, 4203),
 (62, 'Erin', 'Thompson', '713 Griffith Stravenue', 'Port Brandontown', 87776, 8850),
 (71, 'Cheryl', 'Johnson', '10852 Lisa Crescent Apt. 168', 'Port Michael', 18757, 2900)]

In [10]:
%sql select first_name from person where city like 'Port%' limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('Keith',), ('Traci',), ('William',), ('Erin',), ('Cheryl',)]

In [11]:
%%sql 
select * from person where first_name in (select first_name from person where city like 'Port%') and index < 100 limit 5

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[(2, 'Keith', 'Richards', '395 Lloyd Route Apt. 439', 'Port Ashleyville', 1667, 9970),
 (8, 'Cynthia', 'Wilkerson', '013 Tim Track Suite 187', 'North Patriciaport', 65340, 5842),
 (9, 'Brian', 'Kaufman', '0799 Bean Turnpike', 'North Aaron', 89927, 9705),
 (11, 'Eric', 'Castaneda', '9497 Shannon Greens', 'Julieberg', 16296, 9229),
 (27, 'Tiffany', 'Carroll', '91375 Charles Knolls Suite 385', 'Dawnview', 69930, 5511)]

# ETL
* How do we get data into a database?
* There are several different patterns, and at a high level you will hear this refered to as an ETL process: extract, transform, load
* This is often used in data warehousing specifically, and is usually done as a batch process

# ETL Steps
* The first step is extraction, where we pull data out of various databases. This could be csv, json files, or other SQL databases
* The second step is to transform it. Sometimes this is aligning data structures, mapping columns, or reducing the data.
* The third part is to load it, to push it into a new data warehouse (or database) as a solution
* Overall we call the ETL process a "pipeline" (or pipelines)

<img src="https://webassets.mongodb.com/_com_assets/cms/ETL_Visual-sa656kl6df.png" width=60%/>

# ETL Thoughts
* ETL is useful in reducing dependancies in the data created for warehouses and data marts
* ETL process can help with permissions issues and heterogeoneity of data sources, especially in an increasingly json world
* ETL tools are robust and processes are well known
* At the same time, the ETL process overall can be fragile depending upon the developer building it (all it takes is one failed statement to stop a pipeline)
* ETL is slow, and the batch-nature means that the data you are looking at is often not live

In [ ]:
#participation question
%%sql
DROP TABLE IF EXISTS mens_baseball_homeruns;

CREATE TABLE mens_baseball_homeruns(
    school varchar(255),
    num_homeruns integer  
);

INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Illinois', 16);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Nebraska', 30);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Northwestern', 36);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Michigan State', 5);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Michigan', 18);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Indiana', 15);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Maryland', 24);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Penn State', 14);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Minnesota', 11);


SELECT num_homeruns from mens_baseball_homeruns where school like 'Michigan%'

In [ ]:
%%sql
DROP TABLE IF EXISTS field_hockey_scorers;

create table field_hockey_scorers (
    name varchar(255),
    school varchar(255),
    games_played int,
    num_goals int,
    average_per_game float
);

insert into field_hockey_scorers values('Bente Baekers', 'Northwestern', 8, 41, 5.13);
insert into field_hockey_scorers values('Mackenzie Allessie', 'Ohio State', 6, 27, 4.5);
insert into field_hockey_scorers values('Sophia Gladieux', 'Penn State', 9, 29, 3.22);
insert into field_hockey_scorers values('Anna Simon', 'Penn State', 9, 28, 3.11);
insert into field_hockey_scorers values('Maddy Murphy', 'Iowa', 12, 31, 2.58);
insert into field_hockey_scorers values('Hallie ONeill', 'Michigan', 9, 23, 2.56);
insert into field_hockey_scorers values('Sophia Gladieux', 'Penn State', 9, 29, 3.22);
insert into field_hockey_scorers values('Maddie Zimmer', 'Northwestern', 8, 20, 2.5);
insert into field_hockey_scorers values('Riley Donnelly', 'Maryland', 10, 24, 2.4);
insert into field_hockey_scorers values('Peyton Halsey', 'Northwestern', 8, 19, 2.38);
insert into field_hockey_scorers values('Mackenzie Keegan', 'Northwestern', 8, 17, 2.13);

SELECT sum(num_goals) from field_hockey_scorers where games_played >= 9